INSERT INTO "Job_types" VALUES(0, 'актер');
INSERT INTO "Job_types" VALUES(0, 'pежиссеp-постановщик');
INSERT INTO "Job_types" VALUES(0, 'художник-постановщик');
INSERT INTO "Job_types" VALUES(0, 'диpижеp-постановщик');
INSERT INTO "Job_types" VALUES(0, 'музыкант');
INSERT INTO "Job_types" VALUES(0, 'уборщик');

INSERT INTO "Education" VALUES(0, 'среднее');
INSERT INTO "Education" VALUES(0, 'среднее специальное');
INSERT INTO "Education" VALUES(0, 'студент');
INSERT INTO "Education" VALUES(0, 'высшее');

INSERT INTO "Gender" VALUES(0, 'мужской');
INSERT INTO "Gender" VALUES(0, 'женский');

INSERT INTO "Rank" VALUES(0, 'заслуженный артист');
INSERT INTO "Rank" VALUES(0, 'народный артист');
INSERT INTO "Rank" VALUES(0, 'лауреат');

INSERT INTO "Competition" VALUES(0, 'Голос');
INSERT INTO "Competition" VALUES(0, 'Таланты России');

INSERT INTO "Age_category" VALUES(0, 'дети');
INSERT INTO "Age_category" VALUES(0, 'взрослые');

INSERT INTO "Genre" VALUES(0, 'музыкальная комедия');
INSERT INTO "Genre" VALUES(0, 'тpагедия');
INSERT INTO "Genre" VALUES(0, 'опеpетта');

INSERT INTO "Country" VALUES(0, 'Священная Римская империя');

INSERT INTO "Author" VALUES(0, 'Людвиг', 'ван Бетховен', '', 18, 1); 
INSERT INTO "Author" VALUES(0, 'Людвиг ван', 'Бетховен', '', 18, 1); 

/* тест на даты дня рождения и даты найма ------------------------------------------------------------------------------------*/
INSERT INTO "Employee" VALUES(0, 'Иван', '', '', 1, TO_DATE('2019/01/01', 'yyyy/mm/dd'), TO_DATE('2018/01/01', 'yyyy/mm/dd'),
    0, 30000, 4, 1, 0); /* не должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Иван', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2018/01/01', 'yyyy/mm/dd'),
    0, 30000, 4, 1, 1); /* должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
INSERT INTO "Employee" VALUES(0, 'Оксана', '', '', 2, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 4, 2, 1); /* должно вставиться */
/* тест на вставку актеров ---------------------------------------------------------------------------------------------------*/
INSERT INTO "Actor-Rank" VALUES(2, 1, TO_DATE('2013/01/01', 'yyyy/mm/dd'), NULL);   /* не должно вставиться */
INSERT INTO "Actor-Rank" VALUES(1, 1, TO_DATE('1998/01/01', 'yyyy/mm/dd'), 2);      /* не должно вставиться */ 
INSERT INTO "Actor-Rank" VALUES(1, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), 2);      /* должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
INSERT INTO "Employee" VALUES(0, 'Алексей', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 4, 3, 0);     /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Рафаэль', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 4, 4, 1);     /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Марсель', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 4, 3, 1);     /* должно вставиться */
/* тест на назначение постановщиков на спектакль -----------------------------------------------------------------------------*/
INSERT INTO "Show" VALUES(0, 'Творения Прометея', 1, 1, 1, 1, 1, 2, 19, TO_DATE('2022/01/01', 'yyyy/mm/dd'));/* не должно вставиться */
INSERT INTO "Show" VALUES(0, 'Творения Прометея', 2, 1, 1, 1, 1, 2, 19, TO_DATE('2022/01/01', 'yyyy/mm/dd'));/* не должно вставиться */
INSERT INTO "Show" VALUES(0, 'Творения Прометея', 2, 3, 1, 1, 1, 2, 19, TO_DATE('2022/01/01', 'yyyy/mm/dd'));/* не должно вставиться */
INSERT INTO "Show" VALUES(0, 'Творения Прометея', 2, 5, 4, 1, 1, 2, 19, TO_DATE('2022/01/01', 'yyyy/mm/dd'));/* должно вставиться */
/* тест на век спектакля -----------------------------------------------------------------------------------------------------*/
INSERT INTO "Show" VALUES(0, 'Творения Прометея', 2, 5, 4, 1, 1, 2, 17, TO_DATE('2022/01/01', 'yyyy/mm/dd'));/* не должно вставиться */
/* тест на назначение даты премьеры ------------------------------------------------------------------------------------------*/
INSERT INTO "Show" VALUES(0, 'Творения Прометея', 2, 5, 4, 1, 1, 2, 19, TO_DATE('2020/01/01', 'yyyy/mm/dd'));/* не должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
INSERT INTO "Employee" VALUES(0, 'Лариса', '', '', 2, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 1, 6, 1); /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Ксения', '', '', 2, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 1, 5, 1); /* должно вставиться */
/* тест на назначений гастролей ----------------------------------------------------------------------------------------------*/
INSERT INTO "Tour" VALUES(3, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* не должно вставиться */
INSERT INTO "Tour" VALUES(6, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* не должно вставиться */
INSERT INTO "Tour" VALUES(1, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* должно вставиться */
INSERT INTO "Tour" VALUES(2, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* должно вставиться */
INSERT INTO "Tour" VALUES(3, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* не должно вставиться */
INSERT INTO "Tour" VALUES(4, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* должно вставиться */
INSERT INTO "Tour" VALUES(7, 1, TO_DATE('2020/01/01', 'yyyy/mm/dd'), TO_DATE('2021/01/01', 'yyyy/mm/dd'), 1);/* должно вставиться */
/* тест на назначений даты гастролей -----------------------------------------------------------------------------------------*/
INSERT INTO "Tour" VALUES(7, 1, TO_DATE('2021/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'), 1);
/*----------------------------------------------------------------------------------------------------------------------------*/
INSERT INTO "Role" VALUES(0, 1, 'Прометей', 1); /* должно вставиться */
INSERT INTO "Role" VALUES(0, 1, 'Амфион', 0);   /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Алексей', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 3, 1, 0); /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Максим', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 2, 1, 1); /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Юрий', '', '', 1, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 1, 1, 1); /* должно вставиться */
INSERT INTO "Employee" VALUES(0, 'Гузель', '', '', 2, TO_DATE('1999/01/01', 'yyyy/mm/dd'), TO_DATE('2020/01/01', 'yyyy/mm/dd'),
    0, 30000, 1, 1, 1); /* должно вставиться */
/* тест на назначение ролей актерам ------------------------------------------------------------------------------------------*/
INSERT INTO "Direction" VALUES(8, 1, 0);    /* не должно вставиться */
INSERT INTO "Direction" VALUES(5, 1, 0);    /* не должно вставиться */
INSERT INTO "Direction" VALUES(9, 1, 1);    /* должно вставиться */
INSERT INTO "Direction" VALUES(9, 1, 0);    /* не должно вставиться */
INSERT INTO "Direction" VALUES(9, 2, 0);    /* не должно вставиться */
INSERT INTO "Direction" VALUES(1, 1, 1);    /* должно вставиться */
INSERT INTO "Direction" VALUES(10, 1, 0);   /* не должно вставиться */
INSERT INTO "Direction" VALUES(10, 1, 1);   /* не должно вставиться */
INSERT INTO "Direction" VALUES(10, 2, 0);   /* должно вставиться */
INSERT INTO "Direction" VALUES(11, 2, 1);   /* не должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
INSERT INTO "Show" VALUES(0, 'Леонора', 2, 5, 4, 2, 2, 2, 19, TO_DATE('2022/01/01', 'yyyy/mm/dd')); /* должно вставиться */
INSERT INTO "Role" VALUES(0, 2, 'Леонора', 1);  /* должно вставиться */
INSERT INTO "Role" VALUES(0, 2, 'Пицарро', 0);  /* должно вставиться */
/* тест на формирование репертуара -------------------------------------------------------------------------------------------*/
INSERT INTO "Repertoire" VALUES(0, 2, TO_DATE('2023/06/01', 'yyyy/mm/dd')); /* не должно вставиться */
INSERT INTO "Direction" VALUES(9, 3, 0);    /* должно вставиться */
INSERT INTO "Repertoire" VALUES(0, 2, TO_DATE('2023/06/01', 'yyyy/mm/dd')); /* не должно вставиться */
INSERT INTO "Direction" VALUES(10, 3, 1);   /* должно вставиться */
INSERT INTO "Repertoire" VALUES(0, 2, TO_DATE('2023/06/01', 'yyyy/mm/dd')); /* не должно вставиться */
INSERT INTO "Direction" VALUES(11, 4, 1);   /* должно вставиться */
INSERT INTO "Repertoire" VALUES(0, 2, TO_DATE('2018/06/01', 'yyyy/mm/dd')); /* не должно вставиться */
INSERT INTO "Repertoire" VALUES(0, 2, TO_DATE('2023/06/01', 'yyyy/mm/dd')); /* должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
/* тест на создание билета ---------------------------------------------------------------------------------------------------*/
INSERT INTO "Ticket" VALUES(0, 1, 1, 200);  /* должно вставиться */
INSERT INTO "Ticket" VALUES(0, 1, 1, 300);  /* не должно вставиться */
INSERT INTO "Ticket" VALUES(0, 1, 2, 400);  /* должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
/* тест на продажу билета ---------------------------------------------------------------------------------------------------*/
INSERT INTO "Sale" VALUES(1, TO_DATE('1999/06/01', 'yyyy/mm/dd'));  /* проверить время в таблице */
/*----------------------------------------------------------------------------------------------------------------------------*/
/* тест на создание абонемента -----------------------------------------------------------------------------------------------*/
INSERT INTO "Subscription" VALUES(0, 1, 1); /* не должно вставиться */
INSERT INTO "Subscription" VALUES(0, 1, NULL);/* должно вставиться */
INSERT INTO "Subscription" VALUES(0, NULL, 1);/* должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/
INSERT INTO "Repertoire" VALUES(0, 1, TO_DATE('2023/06/01', 'yyyy/mm/dd')); /* должно вставиться */
INSERT INTO "Ticket" VALUES(0, 2, 1, 200);  /* должно вставиться */
INSERT INTO "Ticket" VALUES(0, 2, 2, 400);  /* должно вставиться */
/* тест на заполнение абонемента ---------------------------------------------------------------------------------------------*/
INSERT INTO "Ticket-Subscription" VALUES(1, 1); /* не должно вставиться */
INSERT INTO "Ticket-Subscription" VALUES(3, 1); /* должно вставиться */
INSERT INTO "Ticket-Subscription" VALUES(2, 2); /* не должно вставиться */
INSERT INTO "Ticket-Subscription" VALUES(4, 2); /* должно вставиться */
INSERT INTO "Ticket-Subscription" VALUES(4, 1); /* не должно вставиться */
/*----------------------------------------------------------------------------------------------------------------------------*/